{"cells":[{"cell_type":"markdown","id":"fifteen-sailing","metadata":{"id":"fifteen-sailing"},"source":["# Набор заданий №3\n","\n","### Задание 1\n","В Тридевятом Царстве уже много лет как установилась конституционная монархия. В парламент Тридевятого царства входят 26 партий, обозначаемых строчными буквами английского алфавита от «a» до «z». Заседание парламента в соответствии с регламентом проходит по следующей схеме:\n","- В начале заседания никаких законопроектов на повестке дня не стоит.\n","- Любая партия (в том числе и та, которая внесла текущий законопроект) в любой момент времени может внести на обсуждение новый законопроект.\n","- При вносе партией нового законопроекта обсуждение предыдущего приостанавливается и начинается обсуждение нового. После того, как парламентарии голосуют за новый законопроект, обсуждение законопроекта, прерванного им, продолжается.\n","- Дискуссия по любому законопроекту обязана завершиться голосованием по этому законопроекту.\n","- В конце заседания не должно остаться внесённых законопроектов, дискуссия по которым не завершена.\n","\n","Вам дана запись о событиях на сессии парламента. Каждое событие является либо внесением нового законопроекта, либо голосованием за какой-то законопроект, причём в обоих случаях известен номер партии, этот законопроект предложившей. События даны в том порядке, в котором они происходили. Проверьте, может ли данная запись о событиях соответствовать какому-либо заседанию, удовлетворяющему порядку проведения, описанному выше.\n","#### Ввод\n","Первая строка входных данных содержит одно целое число *K* – количество строк в записи сессии (1 ≤ *K* ≤ 1000). Каждая строка соответствует одному из двух событий:\n","\n","- Add *x* – партия x внесла на голосование законопроект.\n","- Vote *x* – прошло голосование за документ, внесённый партией *x*.\n","\n","Здесь *x* – строчная буква английского алфавита от «a» до «z», задающая партию.\n","#### Вывод\n","Выведите «Yes», если существует корректный порядок проведения заседания, который мог привести к такой записи, и «No», если ни при каком корректном порядке проведения заседания данная запись появиться не могла."]},{"cell_type":"code","execution_count":13,"id":"concerned-lewis","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"concerned-lewis","executionInfo":{"status":"ok","timestamp":1646940080147,"user_tz":-180,"elapsed":23436,"user":{"displayName":"Razor9-3","photoUrl":"https://lh3.googleusercontent.com/a/default-user=s64","userId":"13468343877103654405"}},"outputId":"5a69d773-10af-419e-857c-978fea7ac7c3"},"outputs":[{"output_type":"stream","name":"stdout","text":["K: 5\n","Event #0: Add a\n","Event #1: Add b\n","Event #2: Add c\n","Event #3: Vote c\n","Event #4: Vote a\n","No\n"]}],"source":["def check_raport(events):\n","    rules = []\n","    for e in events:\n","        if e[0] == 'A':\n","            party = e[4]\n","            rules.append(party)\n","        else:\n","            party = e[5]\n","            if len(rules) > 0 and rules.pop() != party:\n","                return False\n","    return len(rules) == 0\n","\n","events = []\n","K = int(input(\"K: \"))\n","for i in range(K):\n","    events.append(input(f\"Event #{i}: \"))\n","\n","if check_raport(events): print(\"Yes\") \n","else: print(\"No\") "]},{"cell_type":"markdown","id":"controversial-location","metadata":{"id":"controversial-location"},"source":["### Задача 2. Правильный подмногоугольник\n","\n","Задан правильный *N*-угольник. Требуется выбрать наименьшее количество его вершин, которые также образуют правильный многоугольник.\n","\n","#### Входные данные\n","\n","Входные данные содержат одно целое число *N* (3 ≤ *N* ≤ 1012).\n","\n","#### Вывод\n","\n","Выведите одно число — наименьшее количество вершин заданного многоугольника, которые образуют правильный многоугольник."]},{"cell_type":"code","execution_count":9,"id":"coated-highway","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"coated-highway","executionInfo":{"status":"ok","timestamp":1646939804209,"user_tz":-180,"elapsed":3642,"user":{"displayName":"Razor9-3","photoUrl":"https://lh3.googleusercontent.com/a/default-user=s64","userId":"13468343877103654405"}},"outputId":"898e8a56-14f2-4b11-cc7d-661b7cbacf97"},"outputs":[{"name":"stdout","output_type":"stream","text":["44\n"]},{"output_type":"execute_result","data":{"text/plain":["4"]},"metadata":{},"execution_count":9}],"source":["import math\n","\n","def min_polygon(n):\n","    if n % 3 == 0: return 3\n","    if n % 4 == 0: return 4\n","    if n % 2 != 0: \n","        for i in range(5, math.ceil(math.sqrt(n)) + 1):\n","            if n % i == 0: return i\n","        return n\n","    for i in range(5, math.ceil(math.sqrt(n)) + 1, 2):\n","        if n % i == 0: return i\n","    return n // 2\n","\n","min_polygon(int(input()))"]},{"cell_type":"markdown","id":"cordless-fundamentals","metadata":{"id":"cordless-fundamentals"},"source":["### Задача 3.\n","\n","На форуме, на котором обсуждаются задачи олимпиад по информатике, ввели следующий аналог капчи. Участнику выдаётся строка из *N* десятичных цифр (без ведущих нулей). В качестве ответа требуется ввести такое основание системы счисления *B*, что в этой системе счисления выданная запись будет соответствовать составному числу (назовем его *D*), а также число *X*, большее 1 и меньшее *D*, являющееся делителем *D*.\n","\n","При этом *B* и *X* не должны превосходить 10^9.\n","\n","По заданной строке десятичных цифр найдите любую пару чисел *B* и *X*, удовлетворяющую ограничениям, или ответьте, что решения в заданных ограничениях не существует.\n","\n","#### Входные данные\n","\n","Входные данные состоят из непустой строки длиной до 3 ⋅ 106 символов, составленной из цифр от 0 до 9 и не начинающейся с 0.\n","\n","#### Вывод\n","\n","Если решение существует, выведите два числа – основание системы счисления *B* и делитель *X*, записанные в десятичной системе счисления. Оба числа должны удовлетворять ограничениям 2 ≤ *B*, *X* ≤ 10^9. Если решения не существует, выведите –1."]},{"cell_type":"code","execution_count":1,"id":"jewish-rocket","metadata":{"scrolled":true,"colab":{"base_uri":"https://localhost:8080/"},"id":"jewish-rocket","executionInfo":{"status":"ok","timestamp":1646939644942,"user_tz":-180,"elapsed":4638,"user":{"displayName":"Razor9-3","photoUrl":"https://lh3.googleusercontent.com/a/default-user=s64","userId":"13468343877103654405"}},"outputId":"6569d80a-2a04-4626-abbb-872364e68843"},"outputs":[{"name":"stdout","output_type":"stream","text":["Number: 13\n"]},{"output_type":"execute_result","data":{"text/plain":["(5, 4)"]},"metadata":{},"execution_count":1}],"source":["def olympic_capcha(digits):\n","    if len(digits) == 1:\n","        d = int(digits[0])\n","        if d == 1 or d == 2 or d == 3 or d == 5 or d == 7:\n","            return -1\n","        elif d % 2 == 0:\n","            return (10, 2)\n","        else:\n","            return (10, 3)\n","    sum = 0\n","    for c in digits:\n","        sum += int(c)\n","    return (sum + 1, max(sum, 2))\n","\n","olympic_capcha(input())"]}],"metadata":{"kernelspec":{"display_name":"Python 3 (ipykernel)","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.9.10"},"colab":{"name":"Task3.ipynb","provenance":[],"collapsed_sections":[]}},"nbformat":4,"nbformat_minor":5}